import { createSlice } from "@reduxjs/toolkit";
import { RootState } from "../index";

export interface Article {
    id: number;
    category: string;
    title: string;
    description: string;
}

const initialState: Article[] = [
    {
        id: 1,
        title: "Історія футболу: від давнини до сьогодення",
        description:
            "Футбол є одним з найпопулярніших видів спорту у світі. Його походження пов'язують з давніми часами, коли жителі різних країн грали у різноманітні версії гри з м'ячем. З часом футбол став все більш популярним та здобув визнання у світі. Перші правила футболу були розроблені в Англії у середині 19 століття, після чого почали виникати перші футбольні клуби та турніри. У 1904 році була створена Федерація футболу (FIFA), яка координує футбольні змагання у всьому світі та розвиває правила гри. Протягом наступних десятиліть футбол став все більш популярним, а футбольні турніри, такі як Чемпіонат світу FIFA та Ліга чемпіонів УЄФА, стали одними з найбільш визнаних та престижних спортивних змагань у світі. Сьогодні футбол є одним з найбільш популярних та відомих видів спорту у світі. Мільйони фанатів стежать за матчами своїх улюблених команд та гравців, а зірки футболу стали справжніми легендами. Футбол постійно розвивається та змінюється, з'являються нові технології та інновації, які допомагають покращувати гру та збільшувати її ефективність. Історія футболу - це історія розвитку не лише самої гри, а й спорту в цілому. Це історія перемог та поразок, легендарних команд та гравців, які стали іконами світового футболу. Вона є невід'ємною частиною нашого спортивного світу та надихає нові покоління футбольних прихильників досліджувати історію футболу та вивчати його розвиток. Останнім часом футбол став більш ніж спортом, він став справжньою культурою, що об'єднує людей незалежно від їхнього соціального статусу, віку, національності та культурних особливостей. Ця гра надихає на досягнення нових висот, розвиває характер та дисципліну, вчить бути чесним та командним гравцем. У світі футболу є багато цікавих та незабутніх моментів, які залишаться в історії. Це можуть бути великі перемоги, які дивували весь світ, знамениті голи, що перейшли в історію футболу, легендарні команди, які завойовували титули та стали іконами футболу. Усі ці моменти показують, наскільки важливим є футбол у нашому світі. Це не просто гра, це культура, яка збагачує наш життєвий досвід та надихає на нові досягнення. Історія футболу - це частина нашої спортивної спадщини, яка завжди буде надихати нові покоління на досягнення нових вершин в цій прекрасній грі.",
        category: "Football",
    },
    {
        id: 2,
        title: "Найвідоміші футбольні турніри світу",
        description:
            "Футбол - це гра, яка об'єднує людей з усього світу. У футболі є безліч турнірів, що проводяться на різних рівнях та в різних країнах. Деякі з цих турнірів стали легендарними та відомими у всьому світі. Ось деякі з найвідоміших футбольних турнірів світу. Чемпіонат світу FIFA - це найвідоміший турнір у світі футболу, який проводиться кожні чотири роки. На цьому турнірі змагається збірні з різних країн світу. Це один з найпрестижніших та найочікуваніших футбольних турнірів у світі. Ліга чемпіонів УЄФА - це щорічний футбольний клубний турнір, який збирає найсильніші клуби з усієї Європи. Ліга чемпіонів УЄФА - це найбільший та найвідоміший клубний турнір у світі. Копа Америка - це щорічний футбольний турнір, який збирає найсильніші збірні з країн Південної та Північної Америки. Це один з найбільш престижних футбольних турнірів у світі. АФК Чемпіонська Ліга - це щорічний клубний турнір, який збирає найсильніші клуби з країн Азії та Океанії. Це найбільший та найвідоміший клубний турнір у цих регіонах. Кубок Африканських Націй - це щорічний футбольний турнір, на якому збираються найкращі збірні з країн Африки. Це один з найбільш престижних футбольних турнірів у світі та найбільший турнір в Африці. Кубок Лібертадорес - це щорічний клубний турнір, який збирає найсильніші клуби з країн Південної Америки. Це найбільший та найвідоміший клубний турнір у Південній Америці. АФК Кубок - це щорічний клубний турнір, який збирає найсильніші клуби з країн Азії. Це другий за величиною турнір після АФК Чемпіонської Ліги та є найбільшим клубним турніром в Азії. Кубок УЄФА - це щорічний клубний турнір, на якому збираються клуби з різних країн Європи, які не входять до Ліги чемпіонів УЄФА. Це другий за престижем клубний турнір в Європі. Кубок Конфедерацій - це турнір, на якому збираються збірні з країн, що входять до конфедерацій ФІФА, окрім збірних з країн-господарів Чемпіонату світу та чемпіонатів своїх континентів. Це один з найвідоміших турнірів у світі футболу. Кубок Азаді - це щорічний футбольний турнір, який проводиться в Ірані. Це найбільший та найпрестижніший футбольний турнір в цій країні. У світі футболу є безліч турнірів на різних рівнях, але ці десять турнірів стали легендарними та відомими у всьому світі. Кожен з цих турнірів має свою історію та величні переможців, які назавжди залишаються в пам'яті футбольних фанатів. Ці турніри не тільки допомагають розвивати футбол у світі, але й зближують людей з різних країн, дозволяючи їм насолоджуватися грою та створювати нові дружні зв'язки.",
        category: "Football",
    },
    {
        id: 3,
        title: "Сучасні тенденції в футбольному тренуванні",
        description:
            "Сучасне футбольне тренування відрізняється від попередніх підходів до підготовки футболістів. Тепер тренери ставляться до цього процесу більш професійно та науково. Основними тенденціями є використання аналітики, зосередження на техніці та фізичній підготовці гравців. Зараз на тренуваннях використовуються спеціальні інструменти, такі як датчики руху, що дозволяють збирати більше даних про гравців та аналізувати їх гру. Також дедалі більше уваги приділяється роботі з м'ячем, техніці та координації рухів. Фізична підготовка гравців також стала важливішою, оскільки сучасний футбол став більш інтенсивним та швидким. Тому тренери використовують нові методики тренувань та спеціальні вправи для зміцнення фізичної форми гравців.",
        category: "Football",
    },

    {
        id: 4,
        title: "Найвідоміші тенісні турніри світу: Ролан Гаррос, Вімблдон, Australian Open, US Open та інші.",
        description:
            "Теніс - це один з найпопулярніших видів спорту у світі, який привертає увагу мільйонів людей. Одним з найбільш очікуваних подій у світі тенісу є чотири Великі турніри: Ролан Гаррос, Вімблдон, Australian Open та US Open. Ролан Гаррос, щороку проводиться у Парижі, Франція, на клейових кортах, і вважається одним з найбільш престижних турнірів. Він привертає до себе увагу широкої аудиторії, яка насолоджується красою гри на глиняному корті. Вімблдон, проводиться щороку на трав'яному корті у Лондоні, Великобританія. Цей турнір вважається найстарішим з усіх Великих турнірів і відомий своєю традиційністю та елегантністю. Australian Open, проводиться на відкритих кортах у Мельбурні, Австралія, і є першим турніром Великого Шолома, що проходить щорічно. Він відомий своїми спекотними умовами та високим рівнем змагань. US Open, проводиться на відкритих кортах у Нью-Йорку, США. Цей турнір відомий своїм гучним ім'ям, емоційними матчами та великою кількістю глядачів. Кожен з цих турнірів має свій унікальний стиль та атмосферу, але всі вони є місцем зіткнення найкращих тенісистів світу. Вони не тільки визначають кращих гравців, але також є фестивалем тенісу, який збирає разом усіх шанувальників цього спорту.",
        category: "Tennis",
    },
    {
        id: 5,
        title: "Найуспішніші тенісисти за всю історію: Роджер Федерер, Рафаель Надаль, Новак Джокович, Серена Вільямс та інші.",
        description:
            "Роджер Федерер, Рафаель Надаль, Новак Джокович та Серена Вільямс - це найбільш успішні тенісисти за всю історію цього виду спорту. Кожен з них має вражаючий список досягнень, включаючи перемоги на турнірах Великого Шолома, Мастерсі та Олімпійських іграх. Вони стали прикладом для молодого покоління тенісистів та продовжують залишатися відомими у світі спорту. Крім того, вони внесли великий вклад у популяризацію тенісу та стали легендами своєї ери. Не дивно, що ці гравці завоювали серця мільйонів шанувальників та відомі не тільки своїми перемогами, а й стали важливими символами в світі спорту.",
        category: "Tennis",
    },
    {
        id: 6,
        title: "Техніка гри в теніс: правильний вибір ракетки, прийом м'яча, удари та інші аспекти.",
        description:
            "Техніка гри в тенісі є дуже важливою для досягнення успіху на корті. Правильний вибір ракетки залежить від стилю гри, а також від фізичних характеристик гравця. Прийом м'яча повинен бути здійснений з правильної позиції тіла та з правильним використанням рук. Удари можуть бути різними залежно від використовуваної техніки, таких як топ-спін, форхенд, бекхенд, волей та інших. Для досягнення успіху в тенісі також важливо мати гарну фізичну форму, здатність до швидких реакцій та рухів, а також витривалість на корті. Крім того, психологічний стан гравця також грає важливу роль у досягненні успіху на корті. Отже, успіх у тенісі залежить від комплексу факторів, які включають правильний вибір ракетки, правильний прийом м'яча, використання різних технік ударів, гарну фізичну форму та психологічну готовність до гри. Вивчення техніки гри в теніс може зайняти багато часу та зусиль, але з правильним підходом та тренуванням можливо досягти значних успіхів на корті.",
        category: "Tennis",
    },

    {
        id: 7,
        title: "Баскетбол у житті молоді: розвиток спорту серед школярів",
        description:
            "Баскетбол - це один з найпопулярніших видів спорту серед молоді. Цей вид спорту допомагає розвивати фізичну форму, координацію та моторні навички, а також вчить командній грі та співпраці. Тому, включення баскетболу у програму фізкультурного виховання для школярів має важливе значення. Розвиток баскетболу серед школярів може допомогти зменшити кількість дітей, які ведуть сидячий спосіб життя, та підвищити рівень активності серед молоді. Участь у баскетбольних змаганнях та тренуваннях може стимулювати дітей до здорового способу життя та сприяти розвитку соціальних навичок. Крім того, баскетбол може допомогти вихованню громадянських якостей серед молоді. Гра в команді сприяє розвитку вміння працювати в групі, виконувати спільні завдання та взаємодіяти з іншими гравцями. Ці навички корисні не тільки в спорті, але й у житті загалом. Отже, розвиток баскетболу серед школярів є важливим завданням. Включення баскетболу у програму фізкультурного виховання, проведення змагань та тренувань можуть сприяти розвитку фізичного та соціального здоров'я молоді. Баскетбол - це більше, ніж просто гра, це можливість для молоді розвивати свої навички та потенціал.",
        category: "Basketball",
    },
    {
        id: 8,
        title: "Баскетбол та технології: як вони впливають на розвиток спорту ",
        description:
            "Технології в останні роки значно змінили спосіб, яким ми граємо та дивимося на баскетбол. Вони вплинули на розвиток спорту, спрощуючи аналіз гри, забезпечуючи точність прийняття рішень та забезпечуючи більш зрозумілі та захоплюючі ігрові досвіди для гравців та глядачів. Технології у побудові стадіонів та арен забезпечують зручність та безпеку глядачів. Рейтингові системи та аналіз даних допомагають тренерам та командам використовувати аналітичні дані для аналізу гри, прогнозування поведінки суперників та розвитку стратегій. Відеоаналіз дозволяє тренерам та командам оглядати відеозаписи гри, аналізувати помилки та виправляти їх. Електронні системи підтримки рішень забезпечують точність прийняття рішень. Використання додатків та соціальних мереж дозволяє гравцям та фанатам ділитися даними про гру, розвивати спільноти та сприяють підвищенню інтересу до баскетболу.",
        category: "Basketball",
    },
    {
        id: 9,
        title: "Роль тренера в баскетболі: відбір гравців та створення стратегії",
        description:
            "Роль тренера в баскетболі полягає в тому, щоб досягти успішних результатів команди. Він відповідає за відбір гравців з відповідними вміннями та навичками, розробку стратегії для команди, підвищення рівня технічних та фізичних навичок гравців, а також психологічний тренінг для підтримки позитивної атмосфери в команді. Він повинен також вести тренувальні заняття, спостерігати за грою та робити належні корективи у стратегії команди для досягнення максимальної ефективності. Таким чином, роль тренера в баскетболі є надзвичайно важливою, оскільки він впливає на результати гри та розвиток гравців у команді.",
        category: "Basketball",
    },
    {
        id: 10,
        title: "Тактики у футболі: від 4-4-2 до tiki-taka",
        description:
            "У футболі тактика гри відіграє важливу роль, вона може визначити результат матчу. Існує безліч тактик, що використовуються командами, від традиційної 4-4-2 до відомої tiki-taka. 4-4-2 є класичною тактикою, коли на полі грають 4 захисники, 4 півзахисники та 2 нападники. Tiki-taka - це більш сучасна та складна тактика, що полягає в збереженні м'яча та постійному переміщенні гравців. Вона відома завдяки успіхам іспанської збірної та команди Барселона. Також існують такі тактики, як 3-5-2, 4-3-3, 4-2-3-1 та багато інших, кожна з яких має свої переваги та недоліки. Вибір тактики залежить від багатьох факторів, таких як склад команди, суперник, мета гри та інші. Незалежно від обраної тактики, вона повинна бути працездатною та ефективною для досягнення мети команди.",
        category: "Football",
    },
    {
        id: 11,
        title: "Найвідоміші футбольні клуби світу",
        description:
            "Футбольні клуби є одними з найважливіших елементів світового футболу. Існує безліч клубів, але деякі з них займають особливе місце в історії та серцях футбольних прихильників. Серед найвідоміших клубів світу можна відзначити Реал Мадрид, Барселону, Манчестер Юнайтед, Ліверпуль, Арсенал, Ювентус та Баварію. Кожен з цих клубів має власну історію, традиції та фанатів. Наприклад, Реал Мадрид є одним з найбільш успішних клубів світу, з 13-ма титулами Ліги Чемпіонів та безліччю національних перемог. Арсенал та Ювентус є відомими своєю технічною та тактичною майстерністю. Барселона та Ліверпуль відомі своїм стилем гри та емоційними матчами. Незалежно від того, який клуб є вашим улюбленим, футбольні клуби є важливою частиною світу футболу та приваблюють мільйони прихильників з усього світу.",
        category: "Football",
    },
    {
        id: 12,
        title: "Зірки футболу: найкращі футболісти світу",
        description:
            "Зірки футболу є невід'ємною частиною світу футболу. Найкращі футболісти світу завжди привертають увагу своєю технікою, навиками та стилем гри. Серед найвідоміших футболістів можна виділити Ліонеля Мессі, Кріштіану Роналду, Неймара, Мохамеда Салаха, Кіліана Мбаппе, Вірджила ван Дейка та інших. Кожен з цих футболістів має власний стиль гри, техніку та тактику, яка допомагає їм досягати успіхів та здобувати нагороди. Наприклад, Ліонель Мессі відомий своєю швидкістю, технікою та ударом, Кріштіану Роналду - своїми сильними ударами та навиками в повітрі, а Мохамед Салах - своїм швидкісним пробігом та точними ударами. Незалежно від того, який футболіст є найулюбленішим, зірки футболу завжди будуть привертати увагу своїм талантом та досягненнями.",
        category: "Football",
    },
    {
        id: 13,
        title: "Культура футболу: як футбол впливає на нашу культуру",
        description:
            "Футбол - це не просто гра, він є частиною культури. Ця гра впливає на наш спосіб життя та мислення, формує наші цінності та ідеали. Футбольні матчі стали частиною культурного життя у багатьох країнах, що об'єднують людей навколо спільної страсті. Футбол відображає наші соціальні та культурні аспекти, такі як національна ідентичність, релігія, політика та інші аспекти. Культура футболу проникає в різні сфери життя, від музики до моди, телебачення та реклами. Футбол стимулює розвиток міжкультурного діалогу та розуміння, здатний змінювати стереотипи та розширювати горизонти людей. Футбол є важливим засобом підтримки взаєморозуміння та солідарності між націями. Таким чином, футбол має великий вплив на нашу культуру та суспільство. Він допомагає нам розширювати наші границі, формує нашу ідентичність та ставить нас на один рівень в спільноті футбольних прихильників. Футбол - це не просто гра, це культура, яка спонукає нас до діалогу, розуміння та згуртування.",
        category: "Football",
    },
    {
        id: 14,
        title: "Поле бою: звички та традиції футбольних матчів",
        description:
            "Футбольні матчі - це не просто змагання команд на полі, це цілий світ звичок та традицій. Кожен матч має свою атмосферу та особливості, які формуються завдяки звичаям та традиціям футбольної спільноти. Одна з найвідоміших традицій футбольних матчів - це спів гімнів перед початком гри. Це не тільки символічний момент, але й можливість для гравців та вболівальників проявити свою патріотичну любов до країни. Іншою важливою традицією є фанатська культура. Вболівальники створюють своїх лідерів та хори, які несуть свої специфічні традиції, символіку та обряди. Вони створюють атмосферу, яка допомагає командам на полі та робить гру цікавішою для глядачів. Традиції також включають в себе деякі обов'язкові елементи одягу для гравців та суддів, розташування на полі, моменти замін гравців та багато іншого. Поле бою - це місце, де відбувається спілкування та змагання між людьми з різних країн та культур. Традиції та звичаї, які існують в футболі, відображають нашу спільну любов до гри та допомагають нам зберігати цінності та культурну спадщину, пов'язану з футболом.",
        category: "Football",
    },
    {
        id: 15,
        title: "Найбільші перемоги та поразки в історії футболу",
        description:
            "Футбол є однією з найбільш популярних спортивних галузей у світі, і в його історії було багато вражаючих перемог та шокуючих поразок. Однією з найбільш вражаючих перемог була перемога збірної Бразилії над збірною Голландії у фіналі чемпіонату світу 1970 року з рахунком 4:1. Бразильці вражали своєю ефектною технікою та швидкою грою, а Пеле забив три голи, допомігши своїй команді здобути перемогу. З іншого боку, однією з найбільш шокуючих поразок в історії футболу є поразка збірної Бразилії у фіналі чемпіонату світу 2014 року з рахунком 1:7 від збірної Німеччини. Бразильці були великими фаворитами на домашньому турнірі, але їхні надії на перемогу розтрощили німці, які забили 5 голів за перші 30 хвилин гри. Історія футболу повна подібних вражаючих перемог та шокуючих поразок, які стали легендарними. Кожна з них відображає емоції, які футбол викликає у людей та доводить, що цей вид спорту завжди буде залишатися одним з найбільш відомих та популярних у світі.",
        category: "Football",
    },
    {
        id: 16,
        title: "Футбол та соціальні мережі: як інтернет змінив світ футболу",
        description:
            "З появою соціальних мереж відбулися зміни у багатьох аспектах життя, в тому числі й у світі футболу. Соціальні мережі стали місцем, де футбольні фанати з усього світу можуть обговорювати матчі, команди, гравців та інші аспекти футболу. Футбольні клуби також використовують соціальні мережі для залучення нових фанатів та збільшення впливу. Вони публікують відео, фотографії, новини та інші матеріали, щоб привернути увагу широкої аудиторії. Крім того, соціальні мережі стали важливим інструментом для комунікації між футболістами та фанатами. Багато футболістів мають свої сторінки в соціальних мережах, де вони можуть спілкуватися зі своїми прихильниками та ділитися своїми думками та враженнями від гри. Соціальні мережі також дали змогу футбольним клубам та лігам підвищити свій дохід, оскільки вони можуть продавати рекламні місця та спонсорські контракти на своїх сторінках в соціальних мережах. У цілому, соціальні мережі значно змінили світ футболу, роблячи його більш доступним для фанатів та сприяючи розвитку футбольних клубів та ліг у всьому світі.",
        category: "Football",
    },
    {
        id: 17,
        title: "Найкращі баскетболісти світу: від Майкла Джордана до Леброна Джеймса",
        description:
            "Історія баскетболу багата на видатних спортсменів, які стали легендами гри. Серед них Майкл Джордан, який протягом своєї кар'єри виграв шість титулів НБА та здобув два олімпійські золоті медалі. Він також займає перше місце серед найкращих бомбардирів у історії баскетболу з результатом 32 292 очки. Інший знаменитий гравець - Леброн Джеймс - також заслуговує на визнання. Він виграв чотири титули НБА, три рази був обраний найціннішим гравцем фіналів та 4 рази - найціннішим гравцем сезону. Леброн Джеймс також здобув дві олімпійські золоті медалі та займає третє місце серед найкращих бомбардирів з результатом 35 367 очок. Серед інших знаменитих гравців можна відзначити Кобі Браянта, котрий виграв п'ять титулів НБА та здобув дві олімпійські золоті медалі, та Вілта Чемберлена, який вважається одним з найбільш ефективних баскетболістів в історії та здобув 2 титули НБА. Усі ці гравці заслуговують на місце в історії баскетболу як найкращі гравці світу. Вони стали прикладом для наступних поколінь і довели, що талант, воля до перемоги та високий рівень майстерності можуть допомогти досягти неймовірних результатів.",
        category: "Basketball",
    },
    {
        id: 18,
        title: "Культові баскетболісти: Шакіл О'Ніл та Кобі Брайант",
        description:
            "Шакіл О'Ніл та Кобі Брайант - два з найбільш визнаних та культових баскетболістів в історії спорту. О'Ніл, також відомий як 'Шак', був високим центровим гравцем зі статурою 7 футів та вагою 325 фунтів. Він виграв 4 титули НБА та 3 рази був обраний найціннішим гравцем фіналів. Кобі Брайант, який помер у 2020 році, був відомий своїми майстерністю та впевненістю на полі. Він виграв 5 титулів НБА, 2 олімпійських золотих медалі та 4 рази був обраний найціннішим гравцем фіналів. Кобі займає четверте місце в історії НБА з результатом 33 643 очки. Обидва гравці зробили неймовірний вплив на світ баскетболу та завжди були центром уваги на полі. Їхні зіткнення під час матчів були одними з найбільш захоплюючих моментів в історії НБА. Незважаючи на свої різні стилі гри та підходи до баскетболу, Шак та Кобі завжди прагнули до перемог та залишили свій неперевершений внесок у світ баскетболу. Кобі Брайант і Шакіл О'Ніл стали легендами баскетболу, а їхня сумісна робота в команді Лос-Анджелес Лейкерс зробила їх незабутніми в історії баскетболу.",
        category: "Basketball",
    },
    {
        id: 19,
        title: " Як баскетбол став одним з найпопулярніших видів спорту в США",
        description:
            "Баскетбол був винайдений Джеймсом Нейсмітом в 1891 році в городі Спрингфілд, штат Массачусетс. З того часу він став одним з найбільш популярних видів спорту в США. Спочатку баскетбол грався на дворах та в університетах, але з часом він став одним з основних спортивних занять в США. Одним з факторів, що допомогли зростанню популярності баскетболу, було створення Національної баскетбольної асоціації (НБА) в 1949 році. Це стало кульмінацією зростання інтересу до спорту та збільшення кількості команд та фанатів. З часом баскетбол став справжнім явищем в США та почав відображати американську культуру та національний дух. Баскетбол також став доступним для більш широкої аудиторії завдяки поширенню телевізійних трансляцій та медіа. Компанії, такі як ESPN та TNT, почали транслювати матчі в прямому ефірі, що дало можливість фанатам бачити своїх улюблених гравців та команд у дії. Це сприяло росту інтересу до баскетболу в США та по всьому світу. Зараз баскетбол є одним з найпопулярніших видів спорту в США, з тисячами клубів та мільйонами фанатів. Його популярність продовжує зростати завдяки новим технологіям та форматам, таким як e-sports, де баскетбол грає важливу роль.",
        category: "Basketball",
    },
    {
        id: 20,
        title: "Секреты успешной защиты в баскетболе",
        description:
            "У баскетболі, тактики гри є ключовим елементом для здобуття перемоги. Ці тактики дозволяють командам збільшити свої шанси на перемогу і показати свій найкращий баскетбол. Найбільш поширені тактики в баскетболі включають: 1. Зона. Це тактика гри, в якій захисники призначаються для охорони певної зони на полі, а не окремих гравців. Це дозволяє захисникам ефективно захищати свою позицію і блокувати кидки від суперників. 2. Людина-літак. Ця тактика полягає в тому, що високий гравець команди захоплює позицію на обох кінцях поля та блокує кидки суперників. 3. Пресинг. Це тактика гри, при якій команда захисників атакує гравців суперника на їхній половині поля, щоб завадити їм розвивати гру. 4. Підбирання. Це тактика гри, коли команда активно збирає м'яч після кидків та розгортає швидкі контратаки на полі. Ці тактики допомагають командам збільшити свої шанси на перемогу та допомагають розширювати стратегію гри. Успішні команди часто використовують різні тактики, щоб здобути перевагу над своїми суперниками та виграти гру. Важливо пам'ятати, що використання тактик у баскетболі потребує високого рівня спілкування та співпраці між гравцями.",
        category: "Basketball",
    },
    {
        id: 21,
        title: "Найкращі моменти в історії олімпійського баскетболу",
        description:
            "Олімпійський баскетбол - це один з найбільш захоплюючих та непередбачуваних видів спорту. За роки свого існування, цей вид спорту подарував глядачам багато яскравих моментів та незабутніх емоцій. Ось кілька з найкращих моментів в історії олімпійського баскетболу: 1. США-СРСР, 1972. Ця гра стала найбільш обговорюваною в історії олімпійського баскетболу. Після двох додаткових періодів гри, США вважалися переможцем, але судді відкликали результат гри та віддали перемогу СРСР. 2. Майкл Джордан, 1992. Це був рік, коли США приймали олімпійські ігри в Барселоні. Джордан здійснив вражаючу подвійну забивку в фіналі проти Хорватії. 3. Лондон, 2012. США протистояли Іспанії в фіналі та здобули золоту медаль. Це був дуже напружений матч, але в кінці США виграли з рахунком 107-100. Ці моменти в історії олімпійського баскетболу залишаться незабутніми для всіх прихильників цього виду спорту. Вони показують, що баскетбол - це не тільки спортивна гра, але і великий духовний досвід.",
        category: "Basketball",
    },
    {
        id: 22,
        title: "Історія розвитку тенісу: від початків гри в середньовічну Францію до сучасної професійної ліги.",
        description:
            "Теніс - це спорт, який має багату історію розвитку. Він з'явився в середньовічній Франції, де його грали на вулицях, використовуючи дерев'яні ракетки та різні м'ячі. З часом, теніс став більш організованою грою, з'явилися перші клуби та турніри. У 1877 році відбувся перший турнір у Вімблдоні, який став першим в історії турніром з тенісу та був відомий своєю великою кількістю глядачів та високим рівнем гри. З часом, теніс став все більш популярним спортом, і з'явилися нові турніри, такі як Australian Open та US Open. У 1968 році було створено професійну тенісну лігу, яка стала платним спортом. Це призвело до зростання популярності тенісу в усьому світі та з'явилися нові зірки, такі як Роджер Федерер, Рафаель Надаль та Новак Джокович. Сьогодні теніс є одним з найбільш популярних та відомих спортів у світі, який привертає велику кількість уваги та фінансів. Він є олімпійським видом спорту та залучає тисячі гравців та глядачів у різних країнах світу. Історія розвитку тенісу є свідченням того, як давня гра на вулицях перетворилася в один з найбільш елегантних та витончених спортів у світі.",
        category: "Tennis",
    },
    {
        id: 23,
        title: "Тенісні тренери: найвідоміші та найуспішніші тренери у світі тенісу.",
        description:
            "Тенісні тренери грають важливу роль у розвитку кар'єри тенісистів, допомагаючи їм поліпшувати свої навички та досягати нових висот. Вони володіють різноманітними методиками та стратегіями тренування, які дозволяють їх гравцям бути готовими до будь-яких викликів на корті. Деякі з найвідоміших тенісних тренерів у світі включають Тоні Надаля, Івана Лендла, Моуратоґлу Патріка, Бориса Беккера та Пете Сампраса. Кожен з цих тренерів допоміг своїм гравцям досягти успіхів у тенісі, включаючи перемоги на турнірах Великого Шолома та Олімпійських іграх. Наприклад, Тоні Надаль - тренер та дядько Рафаеля Надаля, який допоміг своєму племіннику досягти багатьох перемог, включаючи 20 титулів Великого Шолома. Моуратоґлу Патрік - тренер Серени Вільямс, який допоміг їй виграти багато титулів Великого Шолома та повернутися до топ-рівня після народження дитини. Борис Беккер - колишній тенісист та тренер, який працював з Новаком Джоковичем та допоміг йому виграти кілька титулів Великого Шолома. Ці тренери внесли значний внесок у розвиток тенісу та допомогли своїм гравцям досягнути багатьох перемог та стати легендами у світі спорту. Вони продовжують тренувати та розвивати нові таланти, що робить їх незамінними фігурами у світі тенісу.",
        category: "Tennis",
    },
    {
        id: 24,
        title: "Теніс та фітнес: важливість фітнесу для успіху у тенісі та кращі вправи для тренування.",
        description:
            "Успіх у тенісі вимагає не тільки технічної майстерності та ментальної стійкості, але й фізичної підготовки. Фітнес грає дуже важливу роль у підготовці тенісистів до високого рівня гри, а також у запобіганні травм. Найважливіші елементи фітнесу для тенісу - це кардіотренування, розвиток сили, швидкості та гнучкості, розвиток координації та балансу, а також тренування на реакцію та швидкість. Кращі вправи для тренування включають біг, стрибки на скакалці, складні бурі та тренування з використанням власної ваги. Комбіновані тренування, такі як кросфіт або функціональний тренінг, також дуже ефективні для підготовки до тенісу, оскільки вони поєднують в собі кардіо, силову та гнучкісну підготовку. Важливо знаходити баланс між різними видами тренувань, щоб забезпечити всебічну підготовку до гри на корті. Тренування фітнесу не тільки допомагають покращити фізичну форму, але й збільшують витривалість та витривалість на корті, зменшують ризик травм та поліпшують загальний стан здоров'я. Тому, якщо ви хочете стати успішним тенісистом, не забувайте про важливість фітнесу у вашій підготовці!",
        category: "Tennis",
    },
    {
        id: 25,
        title: "Тенісна психологія: важливість ментального підготовки для успіху у тенісі та практичні поради для покращення психологічної стійкості.",
        description:
            "Теніс - це гра не лише на фізичному, але й на ментальному рівні. Успіх у тенісі вимагає не тільки відмінної техніки та фізичної підготовки, але й ментальної стійкості та емоційного контролю. Психологічна підготовка може допомогти тенісистам контролювати свої емоції, покращити концентрацію та зменшити стрес. Деякі з порад для покращення психологічної стійкості включають використання позитивних мантр, зосередження на контролюванні дихання та відволіканні уваги від негативних думок. Крім того, важливо бути готовим до різних ситуацій на корті та розробляти плани дій для різних ситуацій. Наприклад, якщо гравець програє перший сет, важливо мати план дій, який допоможе повернути гру в свою користь. Усі ці поради допоможуть тенісистам стати більш ментально стійкими та ефективними на корті. Тенісна психологія є важливою частиною підготовки до гри та може бути рішенням, яке робить відчутну різницю у грі та результатів.",
        category: "Tennis",
    },
    {
        id: 26,
        title: "Теніс для початківців: правила гри, техніка ударів та інші аспекти гри для новачків.",
        description:
            "Теніс є доступною та захоплюючою грою, яку можуть грати люди будь-якого віку та рівня фізичної підготовки. Основні правила полягають у переміщенні по корті та відбиванні м'яча назад до суперника. Щоб здобути очки, м'яч повинен опинитися в межах корту суперника, який не зможе його відбити. Гравці грають у гейми, з метою перемоги в матчі, виграючи дві з трьох частин. Основні удари у тенісі включають форхенд, бекхенд, сервіс та волей. Форхенд та бекхенд - це удари зі зворотньої та передньої сторони ракетки. Сервіс - це початковий удар, який розпочинає гру. Волей - це удар, який виконується без попереднього замаху. Для початківців важливо мати правильну техніку ударів та володіти навичками переміщення на корті. Також, необхідно володіти адекватною фізичною підготовкою, щоб забезпечити комфорт та підтримку під час гри. Інші аспекти гри, такі як правильний вибір тенісної ракетки та змагальних кортів, також можуть відігравати важливу роль у вашому успіху на корті.",
        category: "Tennis",
    },
    {
        id: 27,
        title: "Теніс та мода: історія модних тенденцій у тенісі та найвідоміші тенісні бренди.",
        description:
            "Теніс завжди був не тільки грою, але й модним спортивним напрямом. Історія моди в тенісі сягає 1800-х років, коли гравці вдягали білі фланелеві шорти та сорочки. У 1920-ті роки жінки почали носити короткі сукні з пляжних тканин на кортах. Згодом, теніс став пов'язаний з такими брендами, як Lacoste, Fred Perry та Nike. Lacoste випускав популярну тенісну сорочку з крокодилом на грудях, яка стала відомою як 'лакостовка'. Fred Perry створив культову футболку з ворітником, яка стала символом британського стилю в тенісі. Nike відомий своїми спортивними взуттям та одягом, що дозволяє гравцям відчувати себе комфортно та стильно на корті. Сьогодні тенісна мода поєднує в собі традиційні елементи та сучасні тенденції. Наприклад, білі сукні залишаються важливою частиною тенісного вбрання на традиційних турнірах, таких як Wimbledon, але сучасні гравці також носять яскраві та вишукані наряди зі спеціальних технологічних тканин. Одяг у тенісі став частою темою для дизайнерів та модних брендів, які створюють спеціальні колекції, що іноді стають лімітованими та колекціонними. Тенісні бренди також активно розвиваються, пропонуючи нові технології та матеріали, що покращують якість та комфортність одягу та взуття на корті.",
        category: "Tennis",
    },
    {
        id: 28,
        title: "Теніс та благодійність: найвідоміші тенісні благодійні організації та проекти, що змінюють життя людей.",
        description:
            "Теніс завжди був пов'язаний зі спонсорськими заходами та благодійністю. Багато з найвідоміших тенісних зірок залучені до різних благодійних організацій та проектів, що мають на меті поліпшення життя людей. Одним з найвідоміших благодійних проектів є Роджер Федерер Фонд, заснований зіркою тенісу Роджером Федерером та його батьками. Фонд підтримує освітні та спортивні проекти для дітей у різних країнах світу, зокрема в Африці та Індії. Іншою відомою благодійною організацією є Всесвітній фонд тенісу (WTA), який співпрацює з різними благодійними організаціями та проектами у більш ніж 30 країнах світу. Фонд відповідає за розвиток тенісу серед дітей та молоді, а також підтримку жіночого тенісу та проектів, що сприяють поліпшенню стану здоров'я та рівності у світі. Також, Надаль Фонд є благодійною організацією, заснованою відомим тенісистом Рафаелем Надалем та його сестрою Маріою Франсескою, яка підтримує соціальні та спортивні проекти для дітей та молоді. У світі тенісу є багато інших благодійних організацій та проектів, таких як Теніс для дітей, Теніс на благо, Кубок Девіса для миру та інші. Кожен з них працює над розвитком тенісу та поліпшенням життя людей, що дістаються від них допомоги.",
        category: "Tennis",
    },
];

const articlesSlice = createSlice({
    name: "articles",
    initialState,
    reducers: {},
});

export default articlesSlice.reducer;

export const selectArticles = (state: RootState) => state.articles;
